app/views/admin/_dock_door.html.erb

SELECT "dock_doors".* FROM "dock_doors" WHERE ("dock_doors".warehouse_id = 1)
---
	<tr><td><%= form.label :name		%>	</td>	<td><%= form.text_field	:name											%>	</td></tr>
	<tr><td><%= form.lable :direction	%>	</td>	<td><%= form.select :direction, DockDoor.directions.collect {|d| [d,d]}	%>	</td></tr>