app/views/admin/_product_warehouse_setup.html.erb

	<tr><td>Warehouse			</td>	<td><%= form.select :warehouse_id, Warehouse.all.collect {|w| [w.name, w.id]}																			%>	</td></tr>
	<tr><td>Product				</td>	<td><%= form.select :product_id, Product.all(:conditions => ["company_id = ?", User.find(session[:user_id]).company.id]).collect {|p| [p.name, p.id]}	%>	</td></tr>
	<tr><td>Lot Management		</td>	<td><%= form.select :lot_management_type, Lot.all_lot_types.collect {|l| [l,l]}																			%>	</td></tr>
	<tr><td>Product Status		</td>	<td><%= form.select :product_status_id,	ProductStatus.all.collect {|ps| [ps.code, ps.id]}																%>	</td></tr>
	<tr><td>Storage Strategy	</td>	<td><%= form.select :storage_strategy_id, StorageStrategy.all(:order => 'code').collect {|ss| [ss.code, ss.id]}, :include_blank => true					%>	</td></tr>
	<tr><td>Allocation Strategy	</td>	<td><%= form.select :allocation_strategy_id, AllocationStrategy.all(:order => 'code').collect {|as| [as.code, as.id]}, :include_blank => true			%>	</td></tr>
---
SELECT "companies".* FROM "companies" WHERE ("companies"."id" = 1) LIMIT 1
SELECT "products".* FROM "products" WHERE ("products"."id" = 2) LIMIT 1
SELECT "users".* FROM "users" WHERE ("users"."id" = 1) LIMIT 1
SELECT "product_statuses".* FROM "product_statuses"
SELECT "storage_strategies".* FROM "storage_strategies" ORDER BY code
SELECT "allocation_strategies".* FROM "allocation_strategies" ORDER BY code