app/views/admin/_supplier.html.erb

SELECT "countries".* FROM "countries" ORDER BY iso_code
---
	<tr><td>Postal Code		</td>	<td><%= form.text_field	:postal_code											%>	</td></tr>
	<tr><td>Country			</td>	<td><%= form.select :country_id, Country.all(:order => 'iso_code').collect {|c| [c.iso_code, c.id]}	%>	</td></tr>