app/views/admin/locations.html.erb

			<tr><td>Location Type	</td>
				<td><%= form.select :location_type_id, @warehouse.location_types.collect {|lt| [lt.code, lt.id]}, :include_blank => true	%>	</td>
			    <td>Allocation Zone </td>
				<td><%= form.select :allocation_zone_id, @warehouse.allocation_zones.collect {|az| [az.code, az.id]}, :include_blank => true	%>	</td>
---
SELECT "location_types".* FROM "location_types" WHERE ("location_types".warehouse_id = 1)
SELECT "locations".* FROM "locations" WHERE ("locations"."location_type_id" = 3) AND ("locations"."warehouse_id" = 1) ORDER BY name
SELECT "allocation_zones".* FROM "allocation_zones" WHERE ("allocation_zones".warehouse_id = 1)
SELECT "locations".* FROM "locations" WHERE ("locations"."allocation_zone_id" = 1) AND ("locations"."warehouse_id" = 1) ORDER BY name

			<tr><td>Storage Zone 	</td>
			    <td><%= form.select :storage_zone_id, @warehouse.storage_zones.collect {|sz| [sz.code, sz.id]}, :include_blank => true		%>	</td>
---
SELECT "storage_zones".* FROM "storage_zones" WHERE ("storage_zones".warehouse_id = 1)