app/views/admin/product_categories.html.erb

		<% form_for :product_category, :url => {:controller => 'admin', :action => 'create_product_category'} do |form| %>
			<%= form.hidden_field :company_id, :value => User.find(session[:user_id]).warehouse.company_id %>
---
SELECT "users".* FROM "users" WHERE ("users"."id" = 1) LIMIT 1
SELECT "warehouses".* FROM "warehouses" WHERE ("warehouses"."id" = 1) LIMIT 1