app/views/admin/product_subcategories.html.erb

		<%= form_for :product_subcategory, :url => {:controller => 'admin', :action => 'create_product_subcategory'} do |form| %>
			<%= form.hidden_field :company_id, :value => User.first(session[:user_id]).warehouse.company_id %>
---
SELECT "users".* FROM "users"