app/views/admin/products.html.erb

SELECT "product_categories".* FROM "product_categories" WHERE ("product_categories".company_id = 1)
SELECT "products".* FROM "products" WHERE ("products"."product_category_id" = 6) AND ("products"."company_id" = 1)
SELECT "product_subcategories".* FROM "product_subcategories" WHERE ("product_subcategories".company_id = 1)
SELECT "products".* FROM "products" WHERE ("products"."product_subcategory_id" = 8) AND ("products"."company_id" = 1)
---
		<table>
			<tr><td>Product Category	</td>	<td><%= form.select :product_category_id, @company.product_categories.collect {|pc| [pc.name, pc.id]}, :include_blank => true 			%></td>
				<td>Product Subcategory	</td>	<td><%= form.select :product_subcategory_id, @company.product_subcategories.collect {|ps| [ps.name, ps.id]}, :include_blank => true 	%></td>

SELECT "suppliers".* FROM "suppliers" WHERE ("suppliers".company_id = 1)
---
			<tr><td>Product Name		</td>	<td><%= form.text_field :name																											%></td>
				<td>Supplier			</td>	<td><%= form.select :supplier_id, @company.suppliers.collect {|s| [s.name, s.id]}, :include_blank => true								%></td>