app/views/admin/replenishment_locations.html.erb

SELECT "allocation_zones".* FROM "allocation_zones" WHERE ("allocation_zones".warehouse_id = 1)
SELECT "allocation_strategies".* FROM "allocation_strategies" WHERE ("allocation_strategies".warehouse_id = 1)
---
			<tr><td>Location				</td>	<td><%= form.text_field	:location																										%>	</td></tr>
			<tr><td>Allocation Zone			</td>	<td><%= form.select :allocation_zone_id, @warehouse.allocation_zones.collect {|az| [az.name, az.id]}, :include_blank => true 			%>	</td></tr>
			<tr><td>Allocation Strategies	</td>	<td><%= form.select :allocation_strategy_id, @warehouse.allocation_strategies.collect {|as| [as.name, as.id]}, :include_blank => true	%>	</td></tr>

SELECT COUNT(*) AS count_id FROM (SELECT 1 FROM "product_location_assignments" WHERE ("product_location_assignments".location_id = 5533)) AS subquery
---
					<tr><td><%= location.name																																	%>	</td>
						<td><%= link_to location.product_location_assignments.count, :controller =>'admin', :action => 'product_location_assignments', :location => location	%>	</td>