app/views/admin/warehouses.html.erb

SELECT "warehouses".* FROM "warehouses" WHERE ("warehouses".company_id = 1)
SELECT COUNT(*) AS count_id FROM (SELECT 1 FROM "warehouses" WHERE ("warehouses".company_id = 1)) AS subquery
---

	<% if @company.warehouses.empty? %>