app/views/receiving/_purchase_order_line.html.erb

	<tr><td>Line Number	</td>	<td><%= form.text_field :line_number											%>	</td></tr>
	<tr><td>Product		</td>	<td><%= form.select :product_id, @company.products.collect {|p| [p.name, p.id]}	%>	</td></tr>
	<tr><td>Product Status	</td>	<td><%= form.select :product_status_id, @company.product_statuses.collect {|ps| [ps.name, ps.id]}, :include_blank => true	%></td></tr>
---
SELECT "products".* FROM "products" WHERE ("products".company_id = 1)
SELECT "product_statuses".* FROM "product_statuses" WHERE ("product_statuses".company_id = 1)