app/views/receiving/_purchase_order.html.erb

SELECT "purchase_order_types".* FROM "purchase_order_types" WHERE ("purchase_order_types".company_id = 1)
SELECT "suppliers".* FROM "suppliers" WHERE ("suppliers".company_id = 1)
---
	<tr><td>Ship Date					</td>	<td><%= form.date_select :ship_date																											%>	</td></tr>
	<tr><td>Purchase Order Type			</td>	<td><%= form.select :purchase_order_type_id, @company.purchase_order_types.collect {|pt| [pt.purchase_order_type, pt.id]}, :include_blank => true	%>	</td></tr>
	<tr><td>Supplier					</td>	<td><%= form.select :supplier_id, @company.suppliers.collect {|s| [s.name, s.id]}, :include_blank => true									%>	</td></tr>