app/views/receiving/_receipt_line.html.erb

	<tr><td>LP			</td>	<td><%= form.text_field :lp																				%>	</td></tr>
	<tr><td>Product		</td>	<td><%= form.select :product_id, @company.products.collect {|p| [p.name, p.id]}, :include_blank => true	%>	</td></tr>
---
SELECT "products".* FROM "products" WHERE ("products".company_id = 1)