app/views/receiving/_receipt.html.erb

	<tr><td>Receipt Number			</td>	<td><%= form.text_field :receipt_number																							%>	</td></tr>
	<tr><td>Supplier				</td>	<td><%= form.select :supplier_id, @warehouse.company.suppliers.collect {|s| [s.name, s.id]}, :include_blank => true				%>	</td></tr>
	<tr><td>Receipt Type			</td>	<td><%= form.select :receipt_type_id, @warehouse.company.receipt_types.collect {|rt| [rt.code, rt.id]}, :include_blank => true	%>	</td></tr>
---
SELECT "suppliers".* FROM "suppliers" WHERE ("suppliers".company_id = 1)
SELECT "receipt_types".* FROM "receipt_types" WHERE ("receipt_types".company_id = 1)