app/views/receiving/purchase_orders.html.erb

	<table>
		<tr><td>Purchase Order Type	</td>	<td><%= form.select :purchase_order_type_id, @company.purchase_order_types.collect {|pt| [pt.purchase_order_type, pt.id]}, :include_blank => true	%>	</td>
			<td>Supplier			</td>	<td><%= form.select :supplier_id, @company.suppliers.collect {|s| [s.name, s.id]}, :include_blank => true									%>	</td>
---
SELECT "purchase_order_types".* FROM "purchase_order_types" WHERE ("purchase_order_types".company_id = 1)
SELECT "purchase_orders".* FROM "purchase_orders" ORDER BY purchase_order_number
SELECT "suppliers".* FROM "suppliers" WHERE ("suppliers".company_id = 1)