app/views/receiving/receipt_lines.html.erb

SELECT COUNT(*) FROM "receipt_lines" WHERE ("receipt_lines".receipt_id = 2)
---
<h3>Receipt Lines	</h3>
<% if @receipt.receipt_lines.empty? %>