app/views/receiving/receipts.html.erb

		<table>
			<tr><td>Supplier		</td>	<td><%= form.select :supplier_id, @warehouse.company.suppliers.collect {|s| [s.name, s.id]}, :include_blank => true				%>	</td>
				<td>Receipt Type	</td>	<td><%= form.select :receipt_type_id, @warehouse.company.receipt_types.collect {|rt| [st.name, st.id]}, :include_blank => true	%>	</td>
---
SELECT "suppliers".* FROM "suppliers" WHERE ("suppliers".company_id = 1)
SELECT "receipt_types".* FROM "receipt_types" WHERE ("receipt_types".company_id = 1)
SELECT "receipts".* FROM "receipts" ORDER BY receipt_number