app/views/receiving/view_purchase_order.html.erb


	<% if @purchase_order.purchase_order_lines.empty?	%>
---
SELECT "purchase_order_lines".* FROM "purchase_order_lines" WHERE ("purchase_order_lines".purchase_order_id = 2)
SELECT COUNT(*) AS count_id FROM (SELECT 1 FROM "purchase_order_lines" WHERE ("purchase_order_lines".purchase_order_id = 2)) AS subquery