app/controllers/admin_controller.rb

SELECT "companies".* FROM "companies" ORDER BY name
---
  def companies
    @companies = Company.all(:order => 'name')

SELECT "countries".* FROM "countries" ORDER BY name
---
  def new_company
    @company = Company.new
    @countries = Country.all(:order => 'name')

SELECT "companies".* FROM "companies" WHERE ("companies"."id" = 1) LIMIT 1
---
  def view_company
    @company = Company.find(params[:company])

SELECT "companies".* FROM "companies" WHERE ("companies"."id" = 1) LIMIT 1
SELECT "countries".* FROM "countries" ORDER BY name
SELECT "uoms".* FROM "uoms" WHERE ("uoms"."type" = 'QuantityUom') AND (company_id = 1 )
---
  def edit_company
    @company = Company.find(params[:company])
    @countries = Country.all(:order => 'name')
    @quantity_uoms = QuantityUom.all(:conditions => "company_id = #{@company.id} ")

SELECT "companies".* FROM "companies" WHERE ("companies"."id" = 1) LIMIT 1
SELECT "users".* FROM "users" WHERE ("users"."id" = 1) LIMIT 1
---
  def warehouses
    @company = User.find(session[:user_id]).company

SELECT "users".* FROM "users" WHERE ("users"."id" = 1) LIMIT 1
---
  def system_parameters
    @user = User.find(session[:user_id])

SELECT "system_parameters".* FROM "system_parameters" WHERE ("system_parameters"."id" = 2) LIMIT 1
---
  def edit_system_parameter
    @system_parameter = SystemParameter.find(params[:system_parameter])

SELECT "system_parameters".* FROM "system_parameters" WHERE ("system_parameters"."id" = 2) LIMIT 1
UPDATE "system_parameters" SET "updated_at" = '2010-10-23 18:10:23.093004', "value" = 'f' WHERE ("system_parameters"."id" = 2)
---
  def update_system_parameter
    @system_parameter = SystemParameter.find(params[:system_parameter][:id])
    if @system_parameter.update_attributes(params[:system_parameter])

SELECT "product_categories".* FROM "product_categories" WHERE (company_id = 1) ORDER BY name
SELECT "users".* FROM "users" WHERE ("users"."id" = 1) LIMIT 1
SELECT "warehouses".* FROM "warehouses" WHERE ("warehouses"."id" = 1) LIMIT 1
---
  def product_categories
    @product_categories = ProductCategory.all(:order => "name", :conditions => ["company_id = ?", User.find(session[:user_id]).warehouse.company_id])

SELECT "product_categories".* FROM "product_categories" WHERE ("product_categories"."id" = 6) LIMIT 1
---
  def product_subcategories
    @product_category = ProductCategory.find(params[:product_category])

SELECT "users".* FROM "users" WHERE ("users"."id" = 1) LIMIT 1
SELECT "warehouses".* FROM "warehouses" WHERE ("warehouses"."id" = 1) LIMIT 1
---
  def products
    @warehouse = User.find(session[:user_id]).warehouse

SELECT "products".* FROM "products" WHERE ("products"."id" = 2) LIMIT 1
---
  def view_product
    @product = Product.find(params[:product])

SELECT "products".* FROM "products" WHERE ("products"."id" = 2) LIMIT 1
---
  def product_packages
    @product = Product.find(params[:product])

SELECT "product_packages".* FROM "product_packages" WHERE ("product_packages"."id" = 4) LIMIT 1
---
  def edit_product_package
    @product_package = ProductPackage.find(params[:product_package])

SELECT "product_packages".* FROM "product_packages" WHERE ("product_packages"."id" = 4) LIMIT 1
---
  def update_product_package
    @product_package = ProductPackage.find(params[:product_package][:id])

SELECT "products".* FROM "products" WHERE ("products"."id" = 2) LIMIT 1
---
  def product_warehouse_setup
    @product = Product.find(params[:product])

SELECT "companies".* FROM "companies" WHERE ("companies"."id" = 1) LIMIT 1
SELECT "uoms".* FROM "uoms" WHERE (company_id = 1)
SELECT "users".* FROM "users" WHERE ("users"."id" = 1) LIMIT 1
---
  def uoms
    @uoms = Uom.all(:conditions => ["company_id = ?", User.find(session[:user_id]).company.id])

SELECT "companies".* FROM "companies" WHERE ("companies"."id" = 1) LIMIT 1
SELECT "suppliers".* FROM "suppliers" WHERE (company_id = 1)
SELECT "users".* FROM "users" WHERE ("users"."id" = 1) LIMIT 1
---
  def suppliers
    @suppliers = Supplier.all(:conditions => ["company_id = ?", User.find(session[:user_id]).company.id])

SELECT "suppliers".* FROM "suppliers" WHERE ("suppliers"."id" = 1) LIMIT 1
---
  def edit_supplier
    @supplier = Supplier.find(params[:supplier])

SELECT "companies".* FROM "companies" WHERE ("companies"."id" = 1) LIMIT 1
SELECT "users".* FROM "users" WHERE ("users"."id" = 1) LIMIT 1
---
  def receipt_types
    @company = User.find(session[:user_id]).company

SELECT "companies".* FROM "companies" WHERE ("companies"."id" = 1) LIMIT 1
SELECT "users".* FROM "users" WHERE ("users"."id" = 1) LIMIT 1
SELECT "product_statuses".* FROM "product_statuses"
---
  def product_statuses
    @company = User.find(session[:user_id]).company
    @product_statuses = ProductStatus.all

SELECT "product_statuses".* FROM "product_statuses" WHERE ("product_statuses"."id" = 2) LIMIT 1
---
  def edit_product_status
    @product_status = ProductStatus.find(params[:product_status])

SELECT "product_statuses".* FROM "product_statuses" WHERE ("product_statuses"."id" = 2) LIMIT 1
UPDATE "product_statuses" SET "code" = 'AP', "updated_at" = '2010-10-26 03:33:51.076853' WHERE ("product_statuses"."id" = 2)
---
  def update_product_status
    @product_status = ProductStatus.find(params[:product_status][:id])
    if @product_status.update_attributes(params[:product_status])

SELECT "storage_zones".* FROM "storage_zones" WHERE (warehouse_id = 1)
SELECT "users".* FROM "users" WHERE ("users"."id" = 1) LIMIT 1
SELECT "warehouses".* FROM "warehouses" WHERE ("warehouses"."id" = 1) LIMIT 1
---
  def storage_zones
    @storage_zones = StorageZone.all(:conditions => ["warehouse_id = ?", User.find(session[:user_id]).warehouse.id])

SELECT "storage_zones".* FROM "storage_zones" WHERE ("storage_zones"."id" = 1) LIMIT 1
---
  def edit_storage_zone
    @storage_zone = StorageZone.find(params[:storage_zone])

SELECT "location_types".* FROM "location_types" ORDER BY code
---
  def location_types
    @location_types = LocationType.all(:order => "code")

SELECT "location_types".* FROM "location_types" WHERE ("location_types"."id" = 4) LIMIT 1
---
  def view_location_type
    @location_type = LocationType.find(params[:location_type])

SELECT "location_types".* FROM "location_types" WHERE ("location_types"."id" = 4) LIMIT 1
---
  def edit_location_type
    @location_type = LocationType.find(params[:location_type])

SELECT "users".* FROM "users" WHERE ("users"."id" = 1) LIMIT 1
SELECT "warehouses".* FROM "warehouses" WHERE ("warehouses"."id" = 1) LIMIT 1
---
  def locations
    @warehouse = User.find(session[:user_id]).warehouse

SELECT "locations".* FROM "locations" WHERE ("locations"."id" = 5429) LIMIT 1
---
  def view_location
    @location = Location.find(params[:location])

SELECT "locations".* FROM "locations" WHERE ("locations"."id" = 5429) LIMIT 1
---
  def edit_location
    @location = Location.find(params[:location])

SELECT "users".* FROM "users" WHERE ("users"."id" = 1) LIMIT 1
SELECT "warehouses".* FROM "warehouses" WHERE ("warehouses"."id" = 1) LIMIT 1
---
  def allocation_zones
    @warehouse = User.find(session[:user_id]).warehouse

SELECT "users".* FROM "users" WHERE ("users".warehouse_id = 1)
SELECT "warehouses".* FROM "warehouses" WHERE ("warehouses"."id" = 1) LIMIT 1
---
  def users
    @warehouse = User.find(session[:user_id]).warehouse

SELECT "users".* FROM "users" WHERE ("users"."id" = 1) LIMIT 1
---
  def view_user
    @user = User.find(params[:user])

SELECT "users".* FROM "users" WHERE ("users"."id" = 1) LIMIT 1
SELECT "warehouses".* FROM "warehouses" WHERE ("warehouses"."id" = 1) LIMIT 1
SELECT "companies".* FROM "companies" WHERE ("companies"."id" = 1) LIMIT 1
SELECT "purchase_order_types".* FROM "purchase_order_types" WHERE (company_id = 1)
---
  def purchase_order_types
    @warehouse = User.find(session[:user_id]).warehouse
    @purchase_order_types = PurchaseOrderType.all(:conditions => ["company_id = ?", @warehouse.company.id])

SELECT "users".* FROM "users" WHERE ("users"."id" = 1) LIMIT 1
SELECT "warehouses".* FROM "warehouses" WHERE ("warehouses"."id" = 1) LIMIT 1
SELECT "companies".* FROM "companies" WHERE ("companies"."id" = 1) LIMIT 1
SELECT "order_types".* FROM "order_types" WHERE ("order_types".company_id = 1)
SELECT COUNT(*) AS count_id FROM (SELECT 1 FROM "order_types" WHERE ("order_types".company_id = 1)) AS subquery
SELECT COUNT(*) AS count_id FROM (SELECT 1 FROM "orders" WHERE ("orders".order_type_id = 2)) AS subquery
---
  def order_types
    @warehouse = User.find(session[:user_id]).warehouse
    @order_types = @warehouse.company.order_types

SELECT "users".* FROM "users" WHERE ("users"."id" = 1) LIMIT 1
SELECT "warehouses".* FROM "warehouses" WHERE ("warehouses"."id" = 1) LIMIT 1
---
  def allocation_strategies
    @warehouse = User.find(session[:user_id]).warehouse

SELECT "allocation_strategies".* FROM "allocation_strategies" WHERE ("allocation_strategies"."id" = 2) LIMIT 1
---
  def edit_allocation_strategy
    @allocation_strategy = AllocationStrategy.find(params[:allocation_strategy])

SELECT "users".* FROM "users" WHERE ("users"."id" = 1) LIMIT 1
SELECT "warehouses".* FROM "warehouses" WHERE ("warehouses"."id" = 1) LIMIT 1
---
  def allocation_strategy_rules
    @warehouse = User.find(session[:user_id]).warehouse

SELECT "companies".* FROM "companies" WHERE ("companies"."id" = 1) LIMIT 1
SELECT "users".* FROM "users" WHERE ("users"."id" = 1) LIMIT 1
---
  def customer_types
    @company = User.find(session[:user_id]).company

SELECT "users".* FROM "users" WHERE ("users"."id" = 1) LIMIT 1
SELECT "warehouses".* FROM "warehouses" WHERE ("warehouses"."id" = 1) LIMIT 1
---
  def storage_strategies
    @warehouse = User.find(session[:user_id]).warehouse

SELECT "storage_strategies".* FROM "storage_strategies" WHERE ("storage_strategies"."id" = 1) LIMIT 1
---
  def storage_strategy_lines
    @storage_strategy = StorageStrategy.find(params[:storage_strategy])

SELECT "users".* FROM "users" WHERE ("users"."id" = 1) LIMIT 1
SELECT "warehouses".* FROM "warehouses" WHERE ("warehouses"."id" = 1) LIMIT 1
---
  def storage_strategy_rules
    @warehouse = User.find(session[:user_id]).warehouse

SELECT "users".* FROM "users" WHERE ("users"."id" = 1) LIMIT 1
SELECT "warehouses".* FROM "warehouses" WHERE ("warehouses"."id" = 1) LIMIT 1
---
  def replenishment_locations
    @warehouse = User.find(session[:user_id]).warehouse

SELECT "locations".* FROM "locations" WHERE ("locations"."id" = 5132) LIMIT 1
---
  def product_location_assignments
    @location = Location.find(params[:location])