app/controllers/login_controller.rb

SELECT "users".* FROM "users" WHERE (username = 'jpcoymat') LIMIT 1
---
  def login
    if request.post?
      @user = User.where(:username => params[:user_login][:username])