app/controllers/main_controller.rb

  def index
    @user = User.find(session[:user_id])
---
SELECT "users".* FROM "users" WHERE ("users"."id" IS NULL) LIMIT 1