app/controllers/receiving_controller.rb

  def purchase_orders
    @company = User.find(session[:user_id]).company
    if request.post?
      params[:purchase_order_criteria].delete_if {|k,v| v.blank?}
      @purchase_orders = PurchaseOrder.all(:conditions => params[:purchase_orders], :order => 'purchase_order_number')
---
SELECT "companies".* FROM "companies" WHERE ("companies"."id" = 1) LIMIT 1
SELECT "users".* FROM "users" WHERE ("users"."id" = 1) LIMIT 1
SELECT "purchase_orders".* FROM "purchase_orders" ORDER BY purchase_order_number

  def new_purchase_order
    @company = User.find(session[:user_id]).company
---
SELECT "companies".* FROM "companies" WHERE ("companies"."id" = 1) LIMIT 1
SELECT "users".* FROM "users" WHERE ("users"."id" = 1) LIMIT 1

  def create_purchase_order
    @purchase_order = PurchaseOrder.new(params[:purchase_order])
    if @purchase_order.save
---
INSERT INTO "purchase_orders" ("supplier_id", "ship_date", "company_id", "purchase_order_number", "purchase_order_type_id", "created_at", "updated_at", "state") VALUES (1, '2010-11-22', 1, 'PO21112010', 0, '2010-11-22 02:35:11.675182', '2010-11-22 02:35:11.675182', 'created') RETURNING "id"

  def edit_purchase_order
    @purchase_order = PurchaseOrder.find(params[:purchase_order])
---
SELECT "purchase_orders".* FROM "purchase_orders" WHERE ("purchase_orders"."id" = 3) LIMIT 1

  def update_purchase_order
    @purchase_order = PurchaseOrder.find(params[:purchase_order][:id])
    if @purchase_order.update_attributes(params[:purchase_order])
---
SELECT "purchase_orders".* FROM "purchase_orders" WHERE ("purchase_orders"."id" = 3) LIMIT 1
UPDATE "purchase_orders" SET "purchase_order_type_id" = 4, "updated_at" = '2010-11-22 02:39:12.979528' WHERE ("purchase_orders"."id" = 3)

  def purchase_order_lines
    @purchase_order = PurchaseOrder.find(params[:purchase_order])
---
SELECT "purchase_orders".* FROM "purchase_orders" WHERE ("purchase_orders"."id" = 2) LIMIT 1

  def create_purchase_order_line
    @purchase_order = PurchaseOrder.find(params[:purchase_order_line][:purchase_order_id])
    @purchase_order_line = PurchaseOrderLine.new(params[:purchase_order_line])
    if @purchase_order_line.save
---
SELECT "purchase_orders".* FROM "purchase_orders" WHERE ("purchase_orders"."id" = 2) LIMIT 1
INSERT INTO "purchase_order_lines" ("comments", "created_at", "line_number", "product_id", "product_status_id", "purchase_order_id", "quantity", "updated_at") VALUES (NULL, '2010-09-12 02:56:27.698778', 10, 2, NULL, 2, 1000.0, '2010-09-12 02:56:27.698778') RETURNING "id"

  def edit_purchase_order_line
    @purchase_order_line = PurchaseOrderLine.find(params[:purchase_order_line])
---
SELECT "purchase_order_lines".* FROM "purchase_order_lines" WHERE ("purchase_order_lines"."id" = 3) LIMIT 1

  def view_purchase_order
    @purchase_order = PurchaseOrder.find(params[:purchase_order])
---
SELECT "purchase_orders".* FROM "purchase_orders" WHERE ("purchase_orders"."id" = 2) LIMIT 1

  def receipts
    @warehouse = User.find(session[:user_id]).warehouse
    if request.post?
      params[:receipts].delete_if {|k,v| v.blank?}
---
SELECT "users".* FROM "users" WHERE ("users"."id" IS NULL) LIMIT 1
SELECT "warehouses".* FROM "warehouses" WHERE ("warehouses"."id" = 1) LIMIT 1
SELECT "receipts".* FROM "receipts" ORDER BY receipt_number

  def new_receipt
    @warehouse = User.find(session[:user_id]).warehouse
---
SELECT "users".* FROM "users" WHERE ("users"."id" = 1) LIMIT 1
SELECT "warehouses".* FROM "warehouses" WHERE ("warehouses"."id" = 1) LIMIT 1

  def create_receipt
    @receipt = Receipt.new(params[:receipt])
    if @receipt.save
---
INSERT INTO "receipts" ("supplier_id", "estimated_receipt_date", "receipt_type_id", "warehouse_id", "receipt_number", "ship_date", "created_at", "updated_at", "real_receipt_date", "state") VALUES (1, '2010-11-30', 3, 1, 'RC00000001', NULL, '2010-11-26 04:15:58.890923', '2010-11-26 04:15:58.890923', NULL, 'created') RETURNING "id"

  def edit_receipt
    @receipt = Receipt.find(params[:receipt])
---
SELECT "receipts".* FROM "receipts" WHERE ("receipts"."id" = 2) LIMIT 1

  def receipt_lines
    @receipt = Receipt.find(param[:receipt])
---
SELECT "receipts".* FROM "receipts" WHERE ("receipts"."id" = 2) LIMIT 1

  def create_receipt_line
    @receipt = Receipt.find(params[:receipt_line][:receipt_id])
    @receipt_line = ReceiptLine.new(params[:receipt_line])
    if @receipt_line.save
---
SELECT "receipts".* FROM "receipts" WHERE ("receipts"."id" = 2) LIMIT 1
INSERT INTO "receipt_lines" ("receipt_id", "lp", "product_id", "lot_id", "product_status_id", "quantity", "created_at", "updated_at", "dock_door_id", "purchase_order_line_id", "state", "received_at") VALUES (6, '8210008767', 2, 1, NULL, 100.0, '2010-11-28 00:16:07.890573', '2010-11-28 00:16:07.890573', NULL, NULL, 'created', NULL) RETURNING "id"